spec/fixtures/scopus_post.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
        <n1:EASIReq xmlns:n1="http://webservices.elsevier.com/schemas/easi/headers/types/v1"
            env:mustUnderstand="0">
          <n1:ReqId>1</n1:ReqId>
          <n1:Ver>2</n1:Ver>
          <n1:Consumer>EXAMPLE</n1:Consumer>
          <n1:ConsumerClient>Article_Level_Metrics</n1:ConsumerClient>
          <n1:LogLevel>Default</n1:LogLevel>
        </n1:EASIReq>
  </env:Header>
  <env:Body>
    <n2:getCitedByCount xmlns:n2="http://webservices.elsevier.com/schemas/metadata/abstracts/types/v10">
      <n2:getCitedByCountReqPayload>
        <n2:absMetSource>all</n2:absMetSource>
        <n2:responseStyle>wellDefined</n2:responseStyle>
        <n2:dataResponseStyle>MESSAGE</n2:dataResponseStyle>
        <n2:inputKey>
          <doi>10.1371/journal.pone.000001</doi>
          <clientCRF>0</clientCRF>
        </n2:inputKey>
      </n2:getCitedByCountReqPayload>
    </n2:getCitedByCount>
  </env:Body>
</env:Envelope>